{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "CampaignInput"}, "name": "CampaignInput", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "UserInput"}, "name": "UserInput", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "CampaignEmbedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 70000, "output_dim": 80, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "CampaignEmbedding", "inbound_nodes": [[["CampaignInput", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "UserEmbedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5000, "output_dim": 80, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "UserEmbedding", "inbound_nodes": [[["UserInput", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "CampaignFlatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "CampaignFlatten", "inbound_nodes": [[["CampaignEmbedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "UserFlatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "UserFlatten", "inbound_nodes": [[["UserEmbedding", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["CampaignFlatten", 0, 0, {}], ["UserFlatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Output", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Output", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["CampaignInput", 0, 0], ["UserInput", 0, 0]], "output_layers": [["Output", 0, 0]]}}, "training_config": {"loss": "mean_squared_error", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "CampaignEmbedding/embeddings", "shape": [70000, 80], "dtype": "float32"}, {"name": "Output/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "Output/bias", "shape": [1], "dtype": "float32"}, {"name": "UserEmbedding/embeddings", "shape": [5000, 80], "dtype": "float32"}, {"name": "dense/kernel", "shape": [160, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}]}]}